---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.RebarCurvesData
source: html/089bc1a9-5840-ed71-b163-6415c5caea26.htm
---
# RebarCurvesData Methods

Adds a new bar to the new rebar geometry. This information is set to the rebar after the API execution is finished successfully.